{"documents":[{"id":9,"insert_ts":"2021-12-20 21:46:49","update_ts":"2021-12-20 21:48:55","user_id":1,"parent_type":"library","parent_id":null,"visibility":"public","title":"Threat Modelling: STRIDE model","content":"STRIDE is a model for identifying computer security threats. It provides a mnemonic for security threats in six categories\n\nThe threats are:\n\n- Spoofing\n- Tampering\n- Repudiation\n- Information disclosure (privacy breach or data leak)\n- Denial of service\n- Elevation of privilege\n\nThe STRIDE was initially created as part of the process of threat modeling. STRIDE is a model of threats, used to help reason and find threats to a system. It is used in conjunction with a model of the target system that can be constructed in parallel. This includes a full breakdown of processes, data stores, data flows, and trust boundaries\n","user_name":"admin"},{"id":7,"insert_ts":"2021-12-20 21:45:00","update_ts":"2021-12-20 21:51:23","user_id":1,"parent_type":"library","parent_id":null,"visibility":"public","title":"Scoping questionnaire for black box or whitebox security tests","content":"## General information\n\n### 1. What is the business requirement for this penetration test?*\n\nFor example, is the driver for this to comply with an audit requirement, or are you seeking to proactively evaluate the security in your environment?\n\n(_) This is required by a regulatory audit or standard.\n(_) Proactive internal decision to determine all weaknesses.\n\n### 2. Will you also conduct a white box pen test or black box test or BOTH?*\n\n[White Box can be best described as a test where specific information has been provided in order to focus the effort. This tests the threat of internal attacks, say originating from people who have access to your network and know a lot about the services, ports, apps, etc running\n\nBlack Box can be best described as a test where no information is provided by the client and the approach is left entirely to the penetration tester (analyst) to determine a means for exploitation – this helps you understand the threat of external attacks]\n\n(_) I will conduct a white box pentest.\n(_) I will conduct a black box pentest.\n(_) I need both.\n\n### 3. How many IP addresses and\/or applications are included as in‐scope for this testing? Please list them, including multiple sites, etc. *\n\nIn case you need a white box pen test, provide the following:\n\n1. IP address range (Internal & External).\n2. Few of the staff’s email addresses & their names for assessing the level of security awareness\n\n___________________________________________\n\n### 4. What are the objectives? *\n\nSelect all objectives that apply\n\n[_] Map out vulnerabilities\n[_] Demonstrate that the vulnerabilities can be exploited\n[_] Actual exploitation of vulnerability in a network system or application\n[_] Obtain privileged access; exploit buffer overflows, SQL injection attacks, etc.\n\n### 5. What is the “target” of the Penetration test? Is it;*\n\n[_] An application\n[_] A website\n[_] A network\n[_] A wireless network\n[_] Others\n\n### 6. Do you also want the following tests to be performed?*\n\nSocial Engineering test – to gain sensitive information from one or more of your employees (to infer or solicit sensitive information)\n\nPlease explain fully:\n___________________________________________\n\n### 7. Will this testing be done on a production environment? *\n\nYou need to understand that certain exploitation of vulnerabilities to determine and\/or prove a weakness could crash your system or cause it to reboot.\n\nOur team is not liable for downtime caused by proving the system’s weakness to attack.\n\n### 8. If production environments must not be affected, does a similar environment (development and\/or test systems) exist that can be used to conduct the pen test?*\n\n### 9 . Are the business owners aware of this pen test? *\n\nAre key stakeholders (business owners) aware that the nature of a pen test is to attack the system as a hacker (or hostile actor) would, in order to learn and prove the system’s weakness?\n\nIn addition to identifying vulnerabilities, if found, we will attempt to exploit them and then show you the results.\n\n### 10. At what time do you want these tests to be performed? *\n\n## Contact Details\n\n### Who is the technical point of contact?\n\n## Additional information? *\n\n","user_name":"admin"},{"id":8,"insert_ts":"2021-12-20 21:45:00","update_ts":null,"user_id":1,"parent_type":"library","parent_id":null,"visibility":"private","title":"Links","content":"CVSS calculator\\\n[https:\/\/www.first.org\/cvss\/calculator\/3.0](https:\/\/www.first.org\/cvss\/calculator\/3.0)\\\n\nExample pentest reports\\\n[https:\/\/pentestreports.com](https:\/\/pentestreports.com)","user_name":"admin"}]}